In [1]:
import pandas as pd

dict1 = {'Name': ['Ovi Naikwade', ' Sudarshan Naikwade', 'Pradnya Naikwade', 'Sunita Naikwade'],
        'City':[' Shedshal', 'Kolhapur ', 'Talandage ', ' Mangsuli '],
        'State':['MH', 'MH', 'TL', 'KA']}
df = pd.DataFrame(dict1)
df

                  Name        City State
0         Ovi Naikwade    Shedshal    MH
1   Sudarshan Naikwade   Kolhapur     MH
2     Pradnya Naikwade  Talandage     TL
3      Sunita Naikwade   Mangsuli     KA

In [2]:
df1 = df.copy()
df1

                  Name        City State
0         Ovi Naikwade    Shedshal    MH
1   Sudarshan Naikwade   Kolhapur     MH
2     Pradnya Naikwade  Talandage     TL
3      Sunita Naikwade   Mangsuli     KA

### 1. str.lower()  and str.upper()

In [3]:
df['Name'].str.lower()

0           ovi naikwade
1     sudarshan naikwade
2       pradnya naikwade
3        sunita naikwade
Name: Name, dtype: object

In [4]:
df['Name_Lower'] = df['Name'].str.lower()
df

                  Name        City State           Name_Lower
0         Ovi Naikwade    Shedshal    MH         ovi naikwade
1   Sudarshan Naikwade   Kolhapur     MH   sudarshan naikwade
2     Pradnya Naikwade  Talandage     TL     pradnya naikwade
3      Sunita Naikwade   Mangsuli     KA      sunita naikwade

In [5]:
df['Name_Upper'] = df['Name'].str.upper()
df

,Name,City,State,Name_Lower,Name_Upper
0,Ovi Naikwade,Shedshal,MH,ovi naikwade,OVI NAIKWADE
1,Sudarshan Naikwade,Kolhapur,MH,sudarshan naikwade,SUDARSHAN NAIKWADE
2,Pradnya Naikwade,Talandage,TL,pradnya naikwade,PRADNYA NAIKWADE
3,Sunita Naikwade,Mangsuli,KA,sunita naikwade,SUNITA NAIKWADE

### str.len()

In [6]:
df['Name'].str.len()

0    12
1    19
2    16
3    15
Name: Name, dtype: int64

In [7]:
df['Name_len']= df['Name'].str.len()
df

,Name,City,State,Name_Lower,Name_Upper,Name_len
0,Ovi Naikwade,Shedshal,MH,ovi naikwade,OVI NAIKWADE,12
1,Sudarshan Naikwade,Kolhapur,MH,sudarshan naikwade,SUDARSHAN NAIKWADE,19
2,Pradnya Naikwade,Talandage,TL,pradnya naikwade,PRADNYA NAIKWADE,16
3,Sunita Naikwade,Mangsuli,KA,sunita naikwade,SUNITA NAIKWADE,15

### 3. str.strip()

In [8]:
df['City'][3]

' Mangsuli '

In [9]:
df['City_strip']= df['City'].str.strip()
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip
0,Ovi Naikwade,Shedshal,MH,ovi naikwade,OVI NAIKWADE,12,Shedshal
1,Sudarshan Naikwade,Kolhapur,MH,sudarshan naikwade,SUDARSHAN NAIKWADE,19,Kolhapur
2,Pradnya Naikwade,Talandage,TL,pradnya naikwade,PRADNYA NAIKWADE,16,Talandage
3,Sunita Naikwade,Mangsuli,KA,sunita naikwade,SUNITA NAIKWADE,15,Mangsuli

In [10]:
df['City_strip'][3]

'Mangsuli'

In [11]:
df["City"].str.lstrip()

0      Shedshal
1     Kolhapur
2    Talandage
3     Mangsuli
Name: City, dtype: object

In [12]:
df['City'].str.rstrip()

0     Shedshal
1     Kolhapur
2    Talandage
3     Mangsuli
Name: City, dtype: object

#### 4. str.split()

In [13]:
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip
0,Ovi Naikwade,Shedshal,MH,ovi naikwade,OVI NAIKWADE,12,Shedshal
1,Sudarshan Naikwade,Kolhapur,MH,sudarshan naikwade,SUDARSHAN NAIKWADE,19,Kolhapur
2,Pradnya Naikwade,Talandage,TL,pradnya naikwade,PRADNYA NAIKWADE,16,Talandage
3,Sunita Naikwade,Mangsuli,KA,sunita naikwade,SUNITA NAIKWADE,15,Mangsuli

In [14]:
df['Name'].str.split(' ')

0            [Ovi, Naikwade]
1    [, Sudarshan, Naikwade]
2        [Pradnya, Naikwade]
3         [Sunita, Naikwade]
Name: Name, dtype: object

In [17]:
df['Name']= df['Name'].str.strip()

In [19]:
df[['First_Name', 'Last_Name']] = df['Name'].str.split(' ', expand= True)
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name
0,Ovi Naikwade,Shedshal,MH,ovi naikwade,OVI NAIKWADE,12,Shedshal,Ovi,Naikwade
1,Sudarshan Naikwade,Kolhapur,MH,sudarshan naikwade,SUDARSHAN NAIKWADE,19,Kolhapur,Sudarshan,Naikwade
2,Pradnya Naikwade,Talandage,TL,pradnya naikwade,PRADNYA NAIKWADE,16,Talandage,Pradnya,Naikwade
3,Sunita Naikwade,Mangsuli,KA,sunita naikwade,SUNITA NAIKWADE,15,Mangsuli,Sunita,Naikwade

### 5. str.comtains()

In [34]:
df[df["Name"].str.contains('Ovi')]

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name
0,Ovi Naikwade,Shedshal,MH,ovi naikwade,OVI NAIKWADE,12,Shedshal,Ovi,Naikwade